# split_list, яка приймає список (цілі числа), знаходить середнє значення бала у списку та ділить його на два списки. 
# У перший потрапляють значення менше середнього, включаючи середнє значення, тоді як у другий — строго більше від середнього. 
# Функція повертає кортеж цих двох списків. Для порожнього списку повертаємо два порожні списки.

def split_list(grade):
    if not grade:
        return ([],[])
    middle = sum(grade)/len(grade)

    part1 = [n for n in grade if n <= middle]
    part2 = [n for n in grade if n > middle]
    return(part1,part2)
        
    
        
    
    
    
    
        
            
        
            
    