# Напишіть функцію визначення кількості днів у конкретному місяці. 
# Ваша функція повинна приймати два параметри: month - номер місяця 
# у вигляді цілого числа в діапазоні від 1 до 12 і year - рік, що складається із чотирьох цифр.
# Перевірте, чи функція коректно обробляє місяць лютий високосного року.

from datetime import date


def get_days_in_month(month, year):
    if month < 1 or month > 12:
        return None
    days = [31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31]

    if (year % 4 == 0 and year % 100 != 0) or (year % 400 == 0):
        days[1] = 29 
    
    return days[month - 1]