# У Python існує рядкова функція isdigit(). 
# Ця функція повертає True, якщо всі символи в рядку є цифрами, 
# і є принаймні один символ, інакше — False. 
# Напишіть функцію з ім'ям is_integer, яка розширюватиме функціональність isdigit(). 
# При перевірці рядка необхідно ігнорувати початкові та кінцеві прогалини в рядку. 
# Після виключення зайвих прогалин рядок вважається таким, що представляє ціле число, якщо:

# її довжина більша або дорівнює одному символу
# вона повністю складається з цифр
# передбачити виняток, що, можливо, є початковий знак "+" або "-", після якого мають йти цифри

def is_integer(s):
    
    if len(s) == 0:
        return False
    # Видаляємо початкові і кінцеві прогалини
    s = s.strip()
    # Перевіряємо, чи рядок є непорожнім
    if not s:
        return False
        # Якщо перший символ - "+", "-", то він може бути, але він не враховується при перевірці на цифри
    if s[0] in ('+', '-'):
        s = s[1:]

    # Перевіряємо, чи всі символи у рядку є цифрами
    return s.isdigit()
  