# При аналізі даних часто виникає необхідність позбавитися екстремальних значень, 
# перш ніж почати працювати з даними далі. Напишіть функцію data_preparation, 
# яка приймає набір даних, список списків (Приклад: [[1,2,3],[3,4], [5,6]]).

# Функція повинна видаляти з переданих списків найбільше і найменше значення, 
# але якщо розмір списку понад два елементи. 
# Після видалення даних з кожного списку необхідно злити їх разом в один список, 
# відсортувати його за зменшенням та повернути отриманий список як результат 
# (Для прикладу вище результат буде наступним: [6, 5, 4, 3, 2]).

def data_preparation(list_data):
    result = []
    for sublist in list_data:
        if len(sublist) > 2:
            min_val = min(sublist)
            max_val = max(sublist)
            
            sublist.remove(min_val)
            sublist.remove(max_val)
        result.extend(sublist)  
        result.sort()
        result.reverse()
    return result

print(data_preparation([[1,2,3],[3,4], [5,6]]))
   