# всі стовпці мають ширину 10 символів
# у заголовків таблиці вирівнювання по центру
# перший стовпець десяткових чисел — вирівнювання по лівому краю
# другий стовпець шістнадцяткових чисел — вирівнювання по центру
# третій стовпець двійкових чисел — вирівнювання з правого краю
# вертикальний символ | не входить у ширину стовпця
# функція formatted_numbers виводить таблицю чисел від 0 до 15 у десятковому, шістнадцятковому та бінарному форматі.

def formatted_numbers():
    formatted_list = []
    
    # Додаємо заголовок у список
    formatted_list.append("|{:^10}|{:^10}|{:^10}|".format("decimal", "hex", "binary"))

    for num in range(0, 16): 
        formatted_str = "|{:<10}|{:^10}|{:>10}|".format(num, hex(num)[2:], bin(num)[2:])
        formatted_list.append(formatted_str)

    return formatted_list
